## Label Encoding

#   Converting Categorical column that contains strings into Numerical values.

#   Why Label Encoding?

     - ML Algorithms can only read numerical values.

In [1]:
import pandas as pd

In [9]:
df = pd.read_csv('F:/03. Suresh/1. Material/05. Data Science/14. Jupyter/08. Data Sets/Datapreprocessing.csv')
df

,Country,Age,Gender,Occupation,Employment Status,Employement Type,Salary,Purchased
0,Poland,34.0,Male,Salaried,Yes,Permanent,72000.0,No
1,Spain,42.0,Female,Business,Yes,Temporary,48000.0,Yes
2,Germany,29.0,Male,Business,No,Temporary,54000.0,No
3,Spain,38.0,Male,Business,No,Permanent,61000.0,No
4,Germany,32.0,Male,Salaried,NaN,Permanent,NaN,Yes
5,Poland,31.0,Female,Business,Yes,Temporary,58000.0,Yes
6,India,NaN,Female,Salaried,NaN,Temporary,52000.0,No
7,Poland,22.0,Female,Salaried,Yes,Self Employed,79000.0,Yes
8,India,38.0,Male,Business,No,NaN,NaN,No
9,Poland,49.0,Male,NaN,Yes,Self Employed,67000.0,Yes
10,Brazil,34.0,Male,Salaried,No,Permanent,70000.0,No
11,Spain,42.0,Female,Business,No,Temporary,48000.0,Yes
12,Germany,29.0,Female,Business,No,Temporary,54000.0,No
13,Spain,38.0,Male,Business,No,Permanent,61000.0,No
14,Germany,NaN,Male,Salaried,Yes,Permanent,NaN,Yes
15,Brazil,32.0,Female,Business,Yes,Temporary,58000.0,Yes
16,Spain,NaN,Female,Salaried,Yes,Temporary,52000.0,Yes
17,England,22.0,Female,Salaried,Yes,NaN,85000.0,Yes
18,Germany,38.0,Male,Business,Yes,NaN,NaN,No
19,England,45.0,Male,NaN,NaN,Self Employed,67000.0,Yes

In [3]:
df.shape

(20, 8)

In [4]:
df.dtypes

Country               object
Age                  float64
Gender                object
Occupation            object
Employment Status     object
Employement Type      object
Salary               float64
Purchased             object
dtype: object

####  Get the rows that contains NULL (NaN)

In [5]:
df.isnull().sum()

Country              0
Age                  3
Gender               0
Occupation           2
Employment Status    3
Employement Type     3
Salary               4
Purchased            0
dtype: int64

#### Fill the NaN values for Occupation, Emplyment Status and Employement Type

In [16]:
col = ['Occupation','Employment Status','Employement Type']
df[col] = df[col].fillna(df.mode().iloc[0])

In [17]:
df.isnull().sum()

Country              0
Age                  3
Gender               0
Occupation           0
Employment Status    0
Employement Type     0
Salary               4
Purchased            0
dtype: int64

In [8]:
df.Occupation.values

array(['Salaried', 'Business', 'Business', 'Business', 'Salaried',
       'Business', 'Salaried', 'Salaried', 'Business', 'Business',
       'Salaried', 'Business', 'Business', 'Business', 'Salaried',
       'Business', 'Salaried', 'Salaried', 'Business', 'Business'],
      dtype=object)

In [11]:
df['Employment Status'].values

array(['Yes', 'Yes', 'No', 'No', nan, 'Yes', nan, 'Yes', 'No', 'Yes',
       'No', 'No', 'No', 'No', 'Yes', 'Yes', 'Yes', 'Yes', 'Yes', nan],
      dtype=object)

In [13]:
df['Employement Type'].values

array(['Permanent', 'Temporary', 'Temporary', 'Permanent', 'Permanent',
       'Temporary', 'Temporary', 'Self Employed', nan, 'Self Employed',
       'Permanent', 'Temporary', 'Temporary', 'Permanent', 'Permanent',
       'Temporary', 'Temporary', nan, nan, 'Self Employed'], dtype=object)

In [18]:
features = df.iloc[:,:-1].values

In [19]:
labels = df.iloc[:,-1].values

In [20]:
from sklearn.preprocessing import Imputer, OneHotEncoder
imputer = Imputer(missing_values='NaN',strategy='mean',axis=0)

C:\Users\deepusuresh\Anaconda3\lib\site-packages\sklearn\utils\deprecation.py:58: DeprecationWarning: Class Imputer is deprecated; Imputer was deprecated in version 0.20 and will be removed in 0.22. Import impute.SimpleImputer from sklearn instead.
  warnings.warn(msg, category=DeprecationWarning)

In [21]:
imputer.fit(features[:,[1,6]])
features[:,[1,6]] = imputer.fit_transform(features[:,[1,6]])

In [22]:
df.isnull().sum()

Country              0
Age                  3
Gender               0
Occupation           0
Employment Status    0
Employement Type     0
Salary               4
Purchased            0
dtype: int64

In [23]:
from sklearn.preprocessing import LabelEncoder
encode = LabelEncoder()

features[:,0] = encode.fit_transform(features[:,0])
features[:,2] = encode.fit_transform(features[:,2])
features[:,3] = encode.fit_transform(features[:,3])
features[:,4] = encode.fit_transform(features[:,4])
features[:,5] = encode.fit_transform(features[:,5])

In [24]:
df.head()

,Country,Age,Gender,Occupation,Employment Status,Employement Type,Salary,Purchased
0,Poland,34.0,Male,Salaried,Yes,Permanent,72000.0,No
1,Spain,42.0,Female,Business,Yes,Temporary,48000.0,Yes
2,Germany,29.0,Male,Business,No,Temporary,54000.0,No
3,Spain,38.0,Male,Business,No,Permanent,61000.0,No
4,Germany,32.0,Male,Salaried,Yes,Permanent,NaN,Yes